@file(synth.tcl) 16: set_db syn_generic_effort high
  Setting attribute of root '/': 'syn_generic_effort' = high
@file(synth.tcl) 17: set_db syn_map_effort     high
  Setting attribute of root '/': 'syn_map_effort' = high
@file(synth.tcl) 18: set_db syn_opt_effort     high
  Setting attribute of root '/': 'syn_opt_effort' = high
@file(synth.tcl) 23: set search_path "."
@file(synth.tcl) 24: set_db init_hdl_search_path $search_path
  Setting attribute of root '/': 'init_hdl_search_path' = .
@file(synth.tcl) 28: read_hdl -sv {
    defs_pkg.sv
    clock_gate_stub.sv
    esram_macro_stub.sv
    parity_checker.sv
    pe.sv
    router.sv
    global_control.sv
    column_slice.sv
    top_decoder_synth.sv
}
@file(synth.tcl) 43: set top_module "top_decoder_synth"
@file(synth.tcl) 44: elaborate $top_module
  Library has 324 usable logic and 128 usable sequential lib-cells.
Info    : Elaborating Design. [ELAB-1]
        : Elaborating top-level block 'top_decoder_synth' from file 'top_decoder_synth.sv'.
Warning : In legacy_ui mode, Genus creates a blackbox as description for a module is not found. Black boxes represent unresolved references in the design and are usually not expected. Another possible reason is, some libraries are not read and the tool could not get the content for some macros or lib_cells. [CDFG-428]
        : A blackbox was created for instance 'qv_bank' in file 'column_slice.sv' on line 48.
        : Check the kind of module a black box is. If it is a lib_cell or a macro, check why the corresponding .lib was not read in. This could be either due to a missing or faulty file or due to an incomplete init_lib_search_path attribute value making restricting access to the missing file. If it is a module of your design, verify whether the path to this module is a part of the files you read or else check that the init_hdl_search_path attribute is not missing some paths.
Warning : In legacy_ui mode, Genus creates a blackbox as description for a module is not found. Black boxes represent unresolved references in the design and are usually not expected. Another possible reason is, some libraries are not read and the tool could not get the content for some macros or lib_cells. [CDFG-428]
        : A blackbox was created for instance 'lvc_bank' in file 'column_slice.sv' on line 67.
Killed
